In [2]:
#Importaciones
import pandas as pd
import numpy as np
from scipy.stats import shapiro, levene
from scipy.stats import ttest_ind 
from scipy.stats import mannwhitneyu
from scipy.stats import chi2_contingency 
import seaborn as sns
import scipy.stats as stats

1.0 EXPLORACIÓN INICIAL

In [ ]:
#Importar CSV 1
df1 = pd.read_csv("files/Customer-Flight-Activity.csv", index_col=0)

In [ ]:
#Importar CSV 2
df2 = pd.read_csv("files/Customer-Loyalty-History.csv", index_col=0)

1.1 Realiza una exploración inicial de los datos para identificar posibles problemas, como valores nulos, atípicos o datos faltantes en las columnas relevantes.

In [36]:
#Ver el head del CSV 1 
df1.head(2)

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
Loyalty Number,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0
100102,2017,1,10,4,14,2030,203.0,0,0

In [37]:
#Ver el head del CSV 2
df2.head(2)

,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
Loyalty Number,,,,,,,,,,,,,,,
480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN

In [13]:
print(f"El número de filas que tenemos es {df1.shape[0]}, y el número de columnas es {df1.shape[1]}")

El número de filas que tenemos es 405624, y el número de columnas es 9

In [14]:
print(f"El número de filas que tenemos es {df2.shape[0]}, y el número de columnas es {df2.shape[1]}")

El número de filas que tenemos es 16737, y el número de columnas es 15

In [35]:
df1.describe()

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
count,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000
mean,2017.500000,6.500000,4.115052,1.031805,5.146858,1208.880059,123.692721,30.696872,2.484503
std,0.500001,3.452057,5.225518,2.076869,6.521227,1433.155320,146.599831,125.486049,10.150038
min,2017.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2017.000000,3.750000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,2017.500000,6.500000,1.000000,0.000000,1.000000,488.000000,50.000000,0.000000,0.000000
75%,2018.000000,9.250000,8.000000,1.000000,10.000000,2336.000000,239.000000,0.000000,0.000000
max,2018.000000,12.000000,21.000000,11.000000,32.000000,6293.000000,676.500000,876.000000,71.000000

In [18]:
df2.describe(include = "object").T

                 count unique       top   freq
Country          16737      1    Canada  16737
Province         16737     11   Ontario   5404
City             16737     29   Toronto   3351
Postal Code      16737     55   V6E 3D9    911
Gender           16737      2    Female   8410
Education        16737      5  Bachelor  10475
Marital Status   16737      3   Married   9735
Loyalty Card     16737      3      Star   7637
Enrollment Type  16737      2  Standard  15766

In [38]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 405624 entries, 100018 to 999986
Data columns (total 9 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Year                         405624 non-null  int64
 1   Month                        405624 non-null  int64
 2   Flights Booked               405624 non-null  int64
 3   Flights with Companions      405624 non-null  int64
 4   Total Flights                405624 non-null  int64
 5   Distance                     405624 non-null  int64
 6   Points Accumulated           405624 non-null  float64
 7   Points Redeemed              405624 non-null  int64
 8   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(8)
memory usage: 30.9 MB

In [39]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16737 entries, 480934 to 652627
Data columns (total 15 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Country             16737 non-null  object
 1   Province            16737 non-null  object
 2   City                16737 non-null  object
 3   Postal Code         16737 non-null  object
 4   Gender              16737 non-null  object
 5   Education           16737 non-null  object
 6   Salary              12499 non-null  float64
 7   Marital Status      16737 non-null  object
 8   Loyalty Card        16737 non-null  object
 9   CLV                 16737 non-null  float64
 10  Enrollment Type     16737 non-null  object
 11  Enrollment Year     16737 non-null  int64
 12  Enrollment Month    16737 non-null  int64
 13  Cancellation Year   2067 non-null   float64
 14  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(2), object(9)
memory usage: 2.0+ MB

1.3 Une los dos conjuntos de datos de la forma más eficiente.

In [62]:
#Unificar los dos CSV 
df_unido = pd.merge(df1, df2, on='Loyalty Number', how='left').reset_index()

In [63]:
df_unido.head()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,...,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,100018,2017,1,3,0,3,1521,152.0,0,0,...,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
1,100102,2017,1,10,4,14,2030,203.0,0,0,...,College,NaN,Single,Nova,2887.74,Standard,2013,3,NaN,NaN
2,100140,2017,1,6,0,6,1200,120.0,0,0,...,College,NaN,Divorced,Nova,2838.07,Standard,2016,7,NaN,NaN
3,100214,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,63253.0,Married,Star,4170.57,Standard,2015,8,NaN,NaN
4,100272,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,91163.0,Divorced,Star,6622.05,Standard,2014,1,NaN,NaN

In [34]:
df_unido["Education"].unique()

array(['Bachelor', 'College', 'Master', 'High School or Below', 'Doctor'],
      dtype=object)

In [41]:
df_unido["Education"].value_counts()

Bachelor                253752
College                 102672
High School or Below     19008
Doctor                   17856
Master                   12336
Name: Education, dtype: int64

In [42]:
df_unido["Year"].unique()

array([2017, 2018])

In [43]:
df_unido["Year"].value_counts()

2017    202812
2018    202812
Name: Year, dtype: int64

In [45]:
df_unido["Flights Booked"].unique()

array([ 3, 10,  6,  0,  8, 11,  9,  4,  7,  5,  2,  1, 12, 13, 14, 16, 15,
       17, 18, 19, 20, 21])

In [46]:
df_unido["Flights Booked"].value_counts()

0     197992
3      18228
11     15705
5      15084
7      14561
8      14357
9      14164
6      13847
2      13641
10     13363
4      12821
1      12667
13     10782
12     10382
14      7057
15      6582
16      4354
17      3899
18      2958
19      1496
20      1156
21       528
Name: Flights Booked, dtype: int64

In [44]:
df_unido.head(1)

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Country,...,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
Loyalty Number,,,,,,,,,,,,,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0,Canada,...,Bachelor,92552.0,Married,Aurora,7919.2,Standard,2016,8,NaN,NaN

In [ ]:
df_unido["Flights Booked"].unique()

In [54]:
# sacamos las columnas que son de tipo object (categóricas) de nuestro DataFrame usando el método '.select_dtypes()'
df_cat = df_unido.select_dtypes(include = "object")
df_cat.head()

,Country,Province,City,Postal Code,Gender,Education,Marital Status,Loyalty Card,Enrollment Type
Loyalty Number,,,,,,,,,
100018,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,Married,Aurora,Standard
100102,Canada,Ontario,Toronto,M1R 4K3,Male,College,Single,Nova,Standard
100140,Canada,British Columbia,Dawson Creek,U5I 4F1,Female,College,Divorced,Nova,Standard
100214,Canada,British Columbia,Vancouver,V5R 1W3,Male,Bachelor,Married,Star,Standard
100272,Canada,Ontario,Toronto,P1L 8X8,Female,Bachelor,Divorced,Star,Standard

In [55]:
df_cat.columns

Index(['Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education',
       'Marital Status', 'Loyalty Card', 'Enrollment Type'],
      dtype='object')

In [56]:
# creamos una variable con los nombres de las columnas del DataFrame de las variables categóricas utilizando el método '.columns'
columnas_cat = df_cat.columns
print(f"Las columnas del DataFrame de variables categóricas son {columnas_cat}")

# empezamos a iterar por cada una de las columnas para sacar sus valores únicos y sus frecuencias
for columna in columnas_cat:
    print(f" \n----------- ESTAMOS ANALIZANDO LA COLUMNA: '{columna.upper()}' -----------\n")
    print(f"Sus valores únicos son: {df_cat[columna].unique()}\n")
    print(f"Las frecuencias de los valores únicos de las categorías son: {df_cat[columna].value_counts()} ")
    print(f"Cantidad de valores nulos: {df_cat[columna].isna().sum()}")

Las columnas del DataFrame de variables categóricas son Index(['Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education',
       'Marital Status', 'Loyalty Card', 'Enrollment Type'],
      dtype='object')

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'COUNTRY' -----------

Sus valores únicos son: ['Canada']

Las frecuencias de los valores únicos de las categorías son: Canada    405624
Name: Country, dtype: int64
Cantidad de valores nulos: 0

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'PROVINCE' -----------

Sus valores únicos son: ['Alberta' 'Ontario' 'British Columbia' 'Saskatchewan' 'Quebec'
 'Newfoundland' 'Manitoba' 'New Brunswick' 'Nova Scotia'
 'Prince Edward Island' 'Yukon']

Las frecuencias de los valores únicos de las categorías son: Ontario                 130896
British Columbia        106848
Quebec                   79968
Alberta                  23400
Manitoba                 15984
New Brunswick            15432
Nova Scotia              12576
Saskatchewan              9936
Newfoundland              6312
Yukon                     2688
Prince Edward Island      1584
Name: Province, dtype: int64
Cantidad de valores nulos: 0

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'CITY' -----------

Sus valores únicos son: ['Edmonton' 'Toronto' 'Dawson Creek' 'Vancouver' 'Regina' 'Montreal'
 'Sudbury' 'Quebec City' 'Peace River' "St. John's" 'Tremblant' 'Ottawa'
 'Trenton' 'Winnipeg' 'Thunder Bay' 'West Vancouver' 'Fredericton'
 'London' 'Halifax' 'Moncton' 'Banff' 'Kingston' 'Whistler'
 'Charlottetown' 'Hull' 'Victoria' 'Calgary' 'Kelowna' 'Whitehorse']

Las frecuencias de los valores únicos de las categorías son: Toronto           81096
Vancouver         62520
Montreal          49920
Winnipeg          15984
Whistler          14040
Halifax           12576
Ottawa            12312
Edmonton          11808
Quebec City       11760
Trenton           11760
Dawson Creek      10776
Fredericton       10344
Regina             9936
Kingston           9720
Tremblant          9600
Victoria           9504
Hull               8688
West Vancouver     7872
St. John's         6312
Thunder Bay        6264
Sudbury            5520
Moncton            5088
Calgary            4584
Banff              4296
London             4224
Peace River        2712
Whitehorse         2688
Kelowna            2136
Charlottetown      1584
Name: City, dtype: int64
Cantidad de valores nulos: 0

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'POSTAL CODE' -----------

Sus valores únicos son: ['T9G 1W3' 'M1R 4K3' 'U5I 4F1' 'V5R 1W3' 'P1L 8X8' 'P1J 8T7' 'S6J 3G0'
 'H2T 9K8' 'V6E 3D9' 'M5V 1G5' 'H2Y 4R4' 'M8Y 4K8' 'V6E 3Z3' 'G1B 3L5'
 'T9O 2W2' 'A1C 6H9' 'H5Y 2S9' 'K1F 2R2' 'K8V 4B2' 'R3R 3T4' 'P1W 1K4'
 'K8T 5M5' 'V6V 8Z3' 'M2M 7K8' 'E3B 2H2' 'M5B 3E4' 'H2Y 2W2' 'P5S 6R4'
 'P2T 6G3' 'B3J 9S2' 'B3C 2M8' 'H4G 3T4' 'R6Y 4T5' 'H2T 2J6' 'M2Z 4K1'
 'S1J 3C5' 'E1A 2A7' 'V1E 4R6' 'T4V 1D4' 'M9K 2P4' 'R2C 0M5' 'T3G 6Y6'
 'M2M 6J7' 'V6T 1Y8' 'C1A 6E8' 'J8Y 3Z5' 'V10 6T5' 'H3T 8L4' 'T3E 2V9'
 'V09 2E9' 'Y2K 6R0' 'K1G 4Z0' 'M2P 4F6' 'M3R 4K8' 'H3J 5I6']

Las frecuencias de los valores únicos de las categorías son: V6E 3D9    21984
V5R 1W3    16608
V6T 1Y8    14040
V6E 3Z3    13200
M2M 7K8    12936
P1J 8T7    12168
H2T 9K8    12024
G1B 3L5    11760
K8V 4B2    11760
H2T 2J6    10800
U5I 4F1    10776
V1E 4R6    10728
E3B 2H2    10344
R2C 0M5    10104
M9K 2P4     9720
H5Y 2S9     9600
V10 6T5     9504
K1F 2R2     9408
H2Y 2W2     8880
J8Y 3Z5     8688
M8Y 4K8     8256
H4G 3T4     8208
B3J 9S2     8016
V6V 8Z3     7872
P2T 6G3     7800
H2Y 4R4     7656
M1R 4K3     7536
P1L 8X8     6792
P1W 1K4     6624
T9G 1W3     6456
A1C 6H9     6312
K8T 5M5     6264
M2Z 4K1     6192
P5S 6R4     5976
M5V 1G5     5520
S6J 3G0     5472
T3G 6Y6     5352
E1A 2A7     5088
T3E 2V9     4584
B3C 2M8     4560
S1J 3C5     4464
T4V 1D4     4296
M5B 3E4     4224
M2M 6J7     3696
R6Y 4T5     3480
M2P 4F6     3048
K1G 4Z0     2904
T9O 2W2     2712
Y2K 6R0     2688
R3R 3T4     2400
H3T 8L4     2184
V09 2E9     2136
C1A 6E8     1584
H3J 5I6      168
M3R 4K8       72
Name: Postal Code, dtype: int64
Cantidad de valores nulos: 0

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'GENDER' -----------

Sus valores únicos son: ['Female' 'Male']

Las frecuencias de los valores únicos de las categorías son: Female    203640
Male      201984
Name: Gender, dtype: int64
Cantidad de valores nulos: 0

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'EDUCATION' -----------

Sus valores únicos son: ['Bachelor' 'College' 'Master' 'High School or Below' 'Doctor']

Las frecuencias de los valores únicos de las categorías son: Bachelor                253752
College                 102672
High School or Below     19008
Doctor                   17856
Master                   12336
Name: Education, dtype: int64
Cantidad de valores nulos: 0

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'MARITAL STATUS' -----------

Sus valores únicos son: ['Married' 'Single' 'Divorced']

Las frecuencias de los valores únicos de las categorías son: Married     235800
Single      108648
Divorced     61176
Name: Marital Status, dtype: int64
Cantidad de valores nulos: 0

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'LOYALTY CARD' -----------

Sus valores únicos son: ['Aurora' 'Nova' 'Star']

Las frecuencias de los valores únicos de las categorías son: Star      184224
Nova      137568
Aurora     83832
Name: Loyalty Card, dtype: int64
Cantidad de valores nulos: 0

----------- ESTAMOS ANALIZANDO LA COLUMNA: 'ENROLLMENT TYPE' -----------

Sus valores únicos son: ['Standard' '2018 Promotion']

Las frecuencias de los valores únicos de las categorías son: Standard          382200
2018 Promotion     23424
Name: Enrollment Type, dtype: int64
Cantidad de valores nulos: 0

In [ ]:
# Porcentaje de nulos de cada columna, para verlo en conjunto

df_unido.isna().sum()/df_unido.shape[0]*100

Year                            0.000000
Month                           0.000000
Flights Booked                  0.000000
Flights with Companions         0.000000
Total Flights                   0.000000
Distance                        0.000000
Points Accumulated              0.000000
Points Redeemed                 0.000000
Dollar Cost Points Redeemed     0.000000
Country                         0.000000
Province                        0.000000
City                            0.000000
Postal Code                     0.000000
Gender                          0.000000
Education                       0.000000
Salary                         25.312112
Marital Status                  0.000000
Loyalty Card                    0.000000
CLV                             0.000000
Enrollment Type                 0.000000
Enrollment Year                 0.000000
Enrollment Month                0.000000
Cancellation Year              87.657535
Cancellation Month             87.657535
dtype: float64

In [60]:
# Metodo para cambiar el tipo de una columna

df_unido['Loyalty Number'].astype(int)

KeyError: 'Loyalty Number'

In [65]:
# Código nos esta diciendo que tenemos filas duplicadas. 1864.
df_unido.duplicated().sum()

1864

In [64]:
df_unido.columns

Index(['Loyalty Number', 'Year', 'Month', 'Flights Booked',
       'Flights with Companions', 'Total Flights', 'Distance',
       'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed',
       'Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education',
       'Salary', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type',
       'Enrollment Year', 'Enrollment Month', 'Cancellation Year',
       'Cancellation Month'],
      dtype='object')

In [ ]:
#Aqui vemos si las filas duplicadas que tenemos tienen los valores iguales para ver si las eliminamos
df_unido[df_unido.duplicated(keep=False)].sort_values(["Loyalty Number", "Year","Month"])

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,...,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
41,101902,2017,1,0,0,0,0,0.0,0,0,...,College,NaN,Married,Aurora,6265.34,Standard,2017,1,NaN,NaN
42,101902,2017,1,0,0,0,0,0.0,0,0,...,College,NaN,Married,Aurora,6265.34,Standard,2017,1,NaN,NaN
16942,101902,2017,2,0,0,0,0,0.0,0,0,...,College,NaN,Married,Aurora,6265.34,Standard,2017,1,NaN,NaN
16943,101902,2017,2,0,0,0,0,0.0,0,0,...,College,NaN,Married,Aurora,6265.34,Standard,2017,1,NaN,NaN
33843,101902,2017,3,0,0,0,0,0.0,0,0,...,College,NaN,Married,Aurora,6265.34,Standard,2017,1,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
151972,992168,2017,9,0,0,0,0,0.0,0,0,...,High School or Below,66386.0,Married,Nova,5746.33,Standard,2012,9,NaN,NaN
304080,992168,2018,6,0,0,0,0,0.0,0,0,...,High School or Below,66386.0,Married,Nova,5746.33,Standard,2012,9,NaN,NaN
304081,992168,2018,6,0,0,0,0,0.0,0,0,...,High School or Below,66386.0,Married,Nova,5746.33,Standard,2012,9,NaN,NaN
354783,992168,2018,9,0,0,0,0,0.0,0,0,...,High School or Below,66386.0,Married,Nova,5746.33,Standard,2012,9,NaN,NaN
354784,992168,2018,9,0,0,0,0,0.0,0,0,...,High School or Below,66386.0,Married,Nova,5746.33,Standard,2012,9,NaN,NaN

In [73]:
# Esto es para borrar los duplicados y mantener el original 

df_sin_dup = df_unido.drop_duplicates(keep='last')

df_sin_dup.head()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,...,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,100018,2017,1,3,0,3,1521,152.0,0,0,...,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
1,100102,2017,1,10,4,14,2030,203.0,0,0,...,College,NaN,Single,Nova,2887.74,Standard,2013,3,NaN,NaN
2,100140,2017,1,6,0,6,1200,120.0,0,0,...,College,NaN,Divorced,Nova,2838.07,Standard,2016,7,NaN,NaN
3,100214,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,63253.0,Married,Star,4170.57,Standard,2015,8,NaN,NaN
4,100272,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,91163.0,Divorced,Star,6622.05,Standard,2014,1,NaN,NaN

In [ ]:
#Aqui comprobamos que realmente se han borrado correctamente los duplicados
df_sin_dup.duplicated().sum()

0

In [33]:
df_unido

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Country,...,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
Loyalty Number,,,,,,,,,,,,,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0,Canada,...,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
100102,2017,1,10,4,14,2030,203.0,0,0,Canada,...,College,NaN,Single,Nova,2887.74,Standard,2013,3,NaN,NaN
100140,2017,1,6,0,6,1200,120.0,0,0,Canada,...,College,NaN,Divorced,Nova,2838.07,Standard,2016,7,NaN,NaN
100214,2017,1,0,0,0,0,0.0,0,0,Canada,...,Bachelor,63253.0,Married,Star,4170.57,Standard,2015,8,NaN,NaN
100272,2017,1,0,0,0,0,0.0,0,0,Canada,...,Bachelor,91163.0,Divorced,Star,6622.05,Standard,2014,1,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
999902,2018,12,0,0,0,0,0.0,0,0,Canada,...,College,NaN,Married,Aurora,7290.07,Standard,2014,5,NaN,NaN
999911,2018,12,0,0,0,0,0.0,0,0,Canada,...,Doctor,217943.0,Single,Nova,8564.77,Standard,2012,8,NaN,NaN
999940,2018,12,3,0,3,1233,123.0,0,0,Canada,...,Bachelor,47670.0,Married,Nova,20266.50,Standard,2017,7,NaN,NaN
999982,2018,12,0,0,0,0,0.0,0,0,Canada,...,College,NaN,Married,Star,2631.56,Standard,2018,7,NaN,NaN
999986,2018,12,0,0,0,0,0.0,0,0,Canada,...,Bachelor,46594.0,Married,Nova,8257.01,2018 Promotion,2018,2,NaN,NaN

In [40]:
df_unido.describe()

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Salary,CLV,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
count,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,302952.000000,405624.000000,405624.000000,405624.000000,50064.000000,50064.000000
mean,2017.500000,6.500000,4.115052,1.031805,5.146858,1208.880059,123.692721,30.696872,2.484503,79268.825953,7991.976226,2015.252529,6.668008,2016.499521,6.966443
std,0.500001,3.452057,5.225518,2.076869,6.521227,1433.155320,146.599831,125.486049,10.150038,34992.133508,6863.663857,1.979427,3.399766,1.384336,3.448300
min,2017.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,-58486.000000,1898.010000,2012.000000,1.000000,2013.000000,1.000000
25%,2017.000000,3.750000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,59262.000000,3985.320000,2014.000000,4.000000,2016.000000,4.000000
50%,2017.500000,6.500000,1.000000,0.000000,1.000000,488.000000,50.000000,0.000000,0.000000,73479.000000,5776.340000,2015.000000,7.000000,2017.000000,7.000000
75%,2018.000000,9.250000,8.000000,1.000000,10.000000,2336.000000,239.000000,0.000000,0.000000,88612.000000,8936.820000,2017.000000,10.000000,2018.000000,10.000000
max,2018.000000,12.000000,21.000000,11.000000,32.000000,6293.000000,676.500000,876.000000,71.000000,407228.000000,83325.380000,2018.000000,12.000000,2018.000000,12.000000

In [28]:
# Tipos de datos de cada columna

df_unido.dtypes

Year                             int64
Month                            int64
Flights Booked                   int64
Flights with Companions          int64
Total Flights                    int64
Distance                         int64
Points Accumulated             float64
Points Redeemed                  int64
Dollar Cost Points Redeemed      int64
Country                         object
Province                        object
City                            object
Postal Code                     object
Gender                          object
Education                       object
Salary                         float64
Marital Status                  object
Loyalty Card                    object
CLV                            float64
Enrollment Type                 object
Enrollment Year                  int64
Enrollment Month                 int64
Cancellation Year              float64
Cancellation Month             float64
dtype: object

In [31]:
# Ver todas las filas duplicadas, incluyendo la primera ocurrencia
df_duplicados_todas = df_unido[df_unido.duplicated(keep=False)]

# Mostrar las filas duplicadas
print(df_duplicados_todas)

                Year  Month  Flights Booked  Flights with Companions  \
Loyalty Number
101902          2017      1               0                        0
101902          2017      1               0                        0
112142          2017      1               0                        0
112142          2017      1               0                        0
126100          2017      1               0                        0
...              ...    ...             ...                      ...
971370          2018     12               0                        0
988392          2018     12               0                        0
988392          2018     12               0                        0
989528          2018     12               0                        0
989528          2018     12               0                        0

                Total Flights  Distance  Points Accumulated  Points Redeemed  \
Loyalty Number
101902                      0         0                 0.0                0
101902                      0         0                 0.0                0
112142                      0         0                 0.0                0
112142                      0         0                 0.0                0
126100                      0         0                 0.0                0
...                       ...       ...                 ...              ...
971370                      0         0                 0.0                0
988392                      0         0                 0.0                0
988392                      0         0                 0.0                0
989528                      0         0                 0.0                0
989528                      0         0                 0.0                0

                Dollar Cost Points Redeemed Country  ... Education    Salary  \
Loyalty Number                                       ...
101902                                    0  Canada  ...   College       NaN
101902                                    0  Canada  ...   College       NaN
112142                                    0  Canada  ...  Bachelor   93073.0
112142                                    0  Canada  ...  Bachelor   93073.0
126100                                    0  Canada  ...    Master  121261.0
...                                     ...     ...  ...       ...       ...
971370                                    0  Canada  ...  Bachelor   63791.0
988392                                    0  Canada  ...   College       NaN
988392                                    0  Canada  ...   College       NaN
989528                                    0  Canada  ...   College       NaN
989528                                    0  Canada  ...   College       NaN

               Marital Status Loyalty Card       CLV  Enrollment Type  \
Loyalty Number
101902                Married       Aurora   6265.34         Standard
101902                Married       Aurora   6265.34         Standard
112142                 Single       Aurora  16272.74         Standard
112142                 Single       Aurora  16272.74         Standard
126100               Divorced         Nova  17790.41         Standard
...                       ...          ...       ...              ...
971370                Married       Aurora   5261.04         Standard
988392                 Single       Aurora   9022.08         Standard
988392                 Single       Aurora   9022.08         Standard
989528               Divorced         Nova   3370.07         Standard
989528               Divorced         Nova   3370.07         Standard

               Enrollment Year Enrollment Month  Cancellation Year  \
Loyalty Number
101902                    2017                1                NaN
101902                    2017                1                NaN
112142                    2015                7                NaN
112142                    2015                7                NaN
126100                    2013               11             2014.0
...                        ...              ...                ...
971370                    2012                7                NaN
988392                    2012                5                NaN
988392                    2012                5                NaN
989528                    2017                5                NaN
989528                    2017                5                NaN

               Cancellation Month
Loyalty Number
101902                        NaN
101902                        NaN
112142                        NaN
112142                        NaN
126100                        7.0
...                           ...
971370                        NaN
988392                        NaN
988392                        NaN
989528                        NaN
989528                        NaN

[3712 rows x 24 columns]